astb_relise/src/Documents/ВыдачаСредствЗащитыСотруднику/ВыдачаСредствЗащитыСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаСредствЗащитыСотруднику</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.ЗаявкаНаПроизвольнуюВыдачуСИЗ</basedOn>
  <basedOn>Document.ВыдачаСредствЗащитыСотруднику</basedOn>
  <basedOn>Document.ОбращениеНаСклад</basedOn>
  <registerRecords>InformationRegister.КодыМаркировкиВыданныхСредствЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиНаВыдачу</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>InformationRegister.СрокиНоскиПоУпрощеннойВыдаче</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <registerRecords>AccumulationRegister.СредстваЗащитыКПолучению</registerRecords>
  <registerRecords>InformationRegister.ШтрихкодыНоменклатурыДляУчетаЧистки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОбращениеНаСклад</types>
      <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
      <types>DocumentRef.ЗаявкаНаПроизвольнуюВыдачуСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛСкладаОтправителя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АХ_СтатусСборки</name>
    <type>
      <types>EnumRef.АХ_СтатусыСборкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>АХ_ПеремещениеПоПредварительнойСборке</name>
    <type>
      <types>DocumentRef.ПеремещениеНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайлМБ7</name>
    <type>
      <types>CatalogRef.ВыдачаСредствЗащитыСотрудникуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещатьВсе</name>
    <comment>Задача 23750</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НеВыдано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеВыданоПоПричине</name>
      <type>
        <types>CatalogRef.ПричиныНевыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПотребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплект</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВКомплекте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСовпаденийНоменклатурыНормы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <comment>Максимальная периодичность выдачи для совпадающих значений номенклатуры нормы</comment>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленаКопированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыдачаСверхНорм</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиКомплекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыНоменклатуры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/ЗаявкаНаПроизвольнуюВыдачуСИЗ/ЗаявкаНаПроизвольнуюВыдачуСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПроизвольнуюВыдачуСИЗ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/CommonModules/ДатыЗапретаИзмененияАСТБ/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается из переопределяемого модуля
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
	НастройкиРаботыИнтерфейса.ИспользоватьВнешнихПользователей = Истина;
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	// Данные(Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Анкета", 				 		 		 "Дата", "Анкетирование", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратИзЧистки", 				 		 "Дата", "Обслуживание",			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратНоменклатурыПоставщику", 			 "Дата", "ВозвратПоставщику", 		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратСредствЗащитыОтСотрудника", 		 "Дата", "Списание",				"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратСредствЗащитыСХранения", 			 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыдачаДежурныхСредствЗащиты", 			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыдачаСредствЗащитыСотруднику", 			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыдачаСредствЗащитыПоВедомости",			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПоставщику", 						 "Дата", "ЗаказПоставщику", 		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакрытиеЗаказовПоставщику", 				 "Дата", "ЗаказПоставщику", 		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаписьНаСклад", 			 				 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗачетВыданныхСредствЗащиты", 			 "Дата", "Нормы", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗачетУпрощеннойВыдачи", 				 	 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаВыдачу", 			 			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ", 			 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияНоменклатуры", 			 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнструктажСотрудников", 			 		 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КадровоеПеремещение", 					 "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КомплектацияНоменклатуры", 				 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаРегистров", 				 "Дата", "Корректировка", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НазначениеОпросов", 				 		 "Дата", "Анкетирование", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОбменСредствЗащитыСотрудника", 			 "Дата", "Обмен", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОбращениеНаСклад", 			 			 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОприходованиеНоменклатуры", 				 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтсутствиеНаРабочемМесте", 				 "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаВЧистку", 				 		 "Дата", "Обслуживание",			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаСИЗвУтилизацию", 				 "Дата", "Обслуживание",			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеНоменклатуры", 				 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеСредствЗащитыНаХранении", 	 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереносЗимнейПотребности",	 			 "Дата", "Зима", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереходПраваСобственности", 				 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеНоменклатуры", 				 "Дата", "Поступление", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриемНаРаботу", 					 		 "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриемСредствЗащитыНаХранение", 			 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказПоНормамВыдачиСИЗ", 				 "Дата", "Приказ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПродлениеСрокаЭксплуатации", 		 	 "Дата", "ОбеспечениеСотрудников",	"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СогласиеНаИнформирование", 		 		 "Дата", "СогласиеНаИнформирование","");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СообщениеSMS", 		 	 				 "Дата", "Администрирование",		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеНоменклатуры", 					 "Дата", "Склад", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеСредствЗащитыСотрудника", 		 "Дата", "Списание",				"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ТранспортнаяПоставка", 		 			 "Дата", "Склад",					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Уведомление", 							 "Дата", "Администрирование", 		"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Увольнение", 							 "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаСоответствийНоменклатурыВыдачи", "Дата", "СоответствиеНоменклатуры","");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаУсловийРаботыСотрудника", 		 "Дата", "УсловияРаботыСотрудника", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаПериодаЗимы", 		 			 "Дата", "Зима", 					"");
	//АсТБ_Alexey_71263_********************************************************************
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаМВЗДолжностей", 		 		 "Дата", "МВЗ", 					"");
	//АсТБ_Alexey_71263_********************************************************************
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаМВЗПодразделений", 		 		 "Дата", "МВЗ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаОсновногоМестаРаботыСотрудника", "Дата", "Кадры", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаФККОНоменклатуры", 				 "Дата", "Обслуживание",			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаШтрихкодовНоменклатуры", 		 "Дата", "Выдача", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЦеновоеСоглашение", 						 "Дата", "Цены", 					"");
	//АсТБ_Alexey_72252_********************************************************************
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыполненныеРаботыПоРемонту",		 		 "Дата", "Обслуживание", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РемонтСредствЗащиты", 			 		 "Дата", "Обслуживание", 			"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЦеновоеСоглашениеПоРемонту", 			 "Дата", "Обслуживание", 			"");
	//АсТБ_Alexey_72252_********************************************************************
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МедицинскийОсмотр",		 	 			 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НаправлениеНаМедицинскийОсмотр",		 	 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказНаПроведениеИнструктажей", 		 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПроверкаЗнанийСотрудника", 				 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказНаПроведениеПроверкиЗнаний", 		 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказНаПроведениеМедицинскихОсмотров", 	 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СпециальнаяОценкаРабочихМест", 		 	 "Дата", "ОТиТБ", 					"");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЭлектронноеПисьмоИсходящее", 		 	 "Дата", "Администрирование",		"");
	//+++АСТБ_Горюшин_Алексей_17125
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПредварительныйПереходПраваСобственности","Дата", "Выдача", 					"");
	//---АСТБ_Горюшин_Алексей_17125
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ПередПроверкойЗапретаИзменения(Объект, СтандартнаяОбработка, УзелПланаОбмена, СообщитьОЗапрете) Экспорт
	
	
КонецПроцедуры
